print("[Minor CN Fixes] Initializing...")

local localization = game.assets.get_resources_by_type("keen::LocaTagCollectionResource")[1].data

local content_hash = nil
for _, loc in ipairs(localization.languages) do
    if loc.language == "Zh_Cn" then
        content_hash = loc.dataHash
        break
    end
end
local original_guid = game.guid.from_content_hash(content_hash)
local original_buf = game.assets.get_content(original_guid):read_data()
local data = original_buf:read_resource("keen::LocaTagCollectionResourceData")

local tag_texts = {
    [3049645436] = "隐藏",
    [1529083238] = "隐藏手套",
    [1583741505] = "隐藏头盔",
    [4258249521] = "隐藏HUD",
    [1727251319] = "瘴气枢纽",
    [2198869897] = "比较装备",
    [1125830499] = "补充的瘴气停留时间",
    [2119713903] = "当瘴气停留时间低于%k时，击败敌人将掉落补充时间的恢复球。",
    [3014896536] = "使用 \"增殖工具 \"将其应用于基地中的建筑。",
    [3655386310] = "一种神奇的工具，能在基地的墙壁上<b>添加或移除各种杂草</b>。 \n\n它只能<b>在火焰祭坛范围内</b>使用，并且需要<b>增殖材料</b>。",
    [2624896441] = "一位乐于助人的村民，很乐意在你的基地中生活与工作。",
    [2593600341] = "一盆美丽的鲜花，能够美化你的世界。",
    [3589593636] = "使你的<b>毒素抗性</b>增加<b>10%</b>，这将降低你承受的<b>毒素</b>伤害。\n\n除此以外，你还有<b>25%</b>的几率避免中毒。",
    [2706117185] = "伤害",
    [3398431124] = "防护",
    [1484904994] = "普通",
    [235247107] = "这个可爱的毛绒玩具能够让最可怕的怪物也变得可爱起来。",
    [2665461345] = "其名为瘴气，一种只求蔓延与吞噬的毁灭性迷雾。",
    [3070911806] = "总算来了！看看你，一副弱不禁风的样子。堂堂火之子就这种样子么？首先需要的是装备... 幸好你先找到了我。你可以先从制作<b>废料剑、尖刺棒或一些铠甲</b>开始着手！",
    [1119452231] =
    "我从未想到自己能够再次看见创世之柱这一侧的日落。记得还小的时候，这里的晚霞更加明亮，有着像薰衣草或葡萄一般绚丽色彩的面纱，夹杂着柑橘与金盏花的颜色，那是夜幕降临之前的一抹斑斓晕影。而现在，只剩下灰蒙蒙的一片。\n\n我向远古者祈祷，希望它们的荣耀与光芒能够庇佑<b>北部车队</b>。我将信念寄托在<lorename>赛鲁斯</lorename>身上。\n<location>长守镇</location>已经引入眼帘……我的人民已经疲惫不堪，但是我们不能停下脚步。我们必须继续前进，为了一路上逝去的每一个人。我已经知道我们绝不能在路上拖泥带水。\n\n我有种奇怪的感觉。一种无法言语的……恐慌。我感觉自己也许无法逗留太久，我感觉自己注定将再次孤独前行……为什么我无法甩掉这种恐惧感？不，难道这是某种……<i>预感</i>？\n— <lorename>杰兹米娜</lorename>女王",
    [1021163939] = "寒冰矢 I",
    [3203744016] = "寒冰矢 II",
    [219934874] = "改进后的魔法弹药，使用时将创造一枚寒冰矢，命中时对敌人造成伤害并使其减速。\n\n<b>法术：使用后会消耗</b>。装备该法术并使用<b>法力</b>来用<b>法杖施法。</b>",
    [3517621637] = "魔法弹药，使用时将创造一枚寒冰矢，命中时对敌人造成伤害并使其减速。\n\n<b>法术：使用后会消耗</b>。装备该法术并使用<b>法力</b>来用<b>法杖施法。</b>",
    [3695884516] = "寒冰矢 I 的永恒版本。该法术会在命中敌人时对其造成伤害，并使其减速。\n\n<b>永恒法术</b>永恒法术不会消耗<b>。</b>装备永恒法术，消耗<b>法力</b>来用<b>法杖施法。</b>",
    [2207530326] =
    "今天，一小队难民从燃火荒原长途跋涉抵达这里。我一向不善于和陌生人打交道，但现在顾不得这么多了。我投入工作，包扎伤口。直到现在这仍是一场生死之战。遗憾的是，有些人死了。我们把他们安葬在<b>地下墓室</b>。愿北风指引他们走向来生。\n\n尽管如此，还有一个人可能会活下来。他腿上的伤口很深，但还没有到无法挽回的地步。伤者萨利姆笑得很开心。他说他欠我一条命......我想，这不过是运气罢了。",
    [3342269239] =
    "今天，我们又安葬了一个人。可怜的人。他一路旅行寻找喘息的机会，却只找到了废墟和残骸。海伦也说，这个教堂撑不住了。风呼啸着，每天晚上都能找到吹进大厅的新口子。我们的屋顶被暴风雨撕裂了，我们忙于照顾车队的人，没空修补它。然而，我们必须留下来。这里需要我们，在其他地方也几乎找不到容身之所。\n\n<i>在遗物和古物旁边</i>埋葬这些流浪汉总让我觉得不对劲，但也许海伦是对的。或许旧时代终究要为新的习俗和仪式让路。",
    [176227438] =
    "我的兄弟，我似乎已经真正到了无药可救的地步。护士海伦说我除了休息之外什么也做不了……但是我拒绝接受这种事。\n\n来自燃火荒原的人们说过远古者神通广大……<i>还记得那个方尖碑吗？小时候我们曾在那里玩耍。我决定无论如何都要去到那里。</i>\n也许那里能找到治好我的方法。不要跟过来，我心意已决。\n\n—维特尔",
    [1974930797] =
    "这些宝石蕴含的力量与魔法截然不同，它们到底是用来做什么的呢？远古者当时已经掌握了使用岩浆与火焰等天然的能量源来驱动各种装置的能力。也许宝石就像是某种能量“仓库”……这些设备会通过磁力吸附至附近天然存在的能量源，储存那些能量再进行对应的转化……问题是究竟是什么惊天动地的发明才需要如此强大的“燃料”？",
    [2074075141] = "极巨魔法箱"
}

for _, tag in ipairs(data.tags) do
    if tag_texts[tag.id.value] then
        tag.text = tag_texts[tag.id.value]
    end
end

local new_buffer = buffer.create()
new_buffer:write_resource("keen::LocaTagCollectionResourceData", data)

local new_content = game.assets.create_content(new_buffer)
content_hash = game.guid.to_content_hash(new_content.guid)

for _, loc in ipairs(localization.languages) do
    if loc.language == "Zh_Cn" then
        loc.dataHash = content_hash
        break
    end
end

print("[Minor CN Fixes] Applied localization fixes.")
